{
	"artworks" : {

		"img/portfolioImages/tryjquery.png" : {
			"name" : "Try jQuery",
			"description" : "Try jQuery Interpreter Project. A project that was started by me at the Techrangers in 2012, but was put on the back burner in early 2013. It was built using jQuery to teach users jQuery. The interpreter works, but the tutorial was never finished."
		},

		"img/portfolioImages/galacticlacquer.png" : {
			"name" : "Galactic Lacquer",
			"description" : "My personal blog, Galactic Lacquer. I focus on nail art, nail polish, and makeup reviews. I heavily modified the Blogger template and created all of my own graphics. I also take and edit all of my own photos, and manage several social media pages for the blog. I also maintain several PR relationships as well."
		},

		"img/portfolioImages/galacticlacquer.png" : {
			"name" : "Techranger Team Site Redesign",
			"description" : "I am the project lead on the current redesign of the Techranger team website. Everything has been made from scratch utilizing HTML5, CSS3, and PHP. I created the bulk of the code while updating an existing design that someone had mocked up in Photoshop a couple years ago."
		},






		"img/portfolioImages/gra1.jpg" : {
			"name" : "Tech Time Flyer",
			"description" : "I created a quick flyer for the Techrangers' first ever Extended Tech Time using Adobe Photoshop. 2013"
		},

		"img/portfolioImages/gra2.png" : {
			"name" : "Tech Time Poster",
			"description" : "I created a poster featuring the Techranger robot for the Techrangers' second Tech Time conference using Adobe Photoshop. 2013"
		},

		"img/portfolioImages/gra3.png" : {
			"name" : "Tech Time Poster",
			"description" : "I created a poster featuring the Techranger robot for the Techrangers' second Tech Time conference using Adobe Photoshop. 2013"
		},



		"img/portfolioImages/gra4.png" : {
			"name" : "OneSearchLite Logo",
			"description" : "I created a logo for OneSearchLite which is currently being used in the University of Central Florida's online webcourses in Canvas. The OneSearch logo already existed, but I modified it for the 'lite' use version. 2013"
		},

		"projects/dsi_project/dsirender.jpg" : {
			"name" : "Nintendo DSi 3D Model",
			"description" : "An assignment where I had to create an object of my choosing using Autodesk Maya. I chose a Nintendo DSi, and modeled and textured it myself from scratch. It looks dirty and broken to practice creating more interesting textures."
		},





	
		"img/portfolioImages/d2_5.jpg" : {
			"name" : "Drawing II",
			"description" : "Human skeleton study. Charcoal and pastel on newsprint. 24x36 in."
		},
			
		"img/portfolioImages/2d_1.jpg" : {
			"name" : "2-Dimensional Design",
			"description" : "Experimenting with basic shapes. Paint and painted paper on illustration board. 24x36 in."
		},
		
		"img/portfolioImages/d2_3.jpg" : {
			"name" : "Drawing II",
			"description" : "Still life with female model and bovine skulls. Charcoal and pastel on newsprint. 24x36 in."
		},

		

		"img/portfolioImages/d2_1.jpg" : {
			"name" : "Drawing II",
			"description" : "Still life with male model and human skeleton. Charcoal and pastel on newsprint. 24x36 in."
		},
		
		"img/portfolioImages/3d_1.jpg" : {
			"name" : "3-Dimensional Design",
			"description" : "Wrench model made entirely out of paper products. Paper, illustration board, gesso."
		},
		
		"img/portfolioImages/d2_2.jpg" : {
			"name" : "Drawing II",
			"description" : "Still life with male model, skeleton, cloth, and mirrors. Charcoal and pastel on newsprint. 24x36 in."
		},


		
		"img/portfolioImages/2d_2.jpg" : {
			"name" : "2-Dimensional Design",
			"description" : "Composition with unconventional media. Aluminum, ribbon, popcorn, glue, and paint on illustration board. 24x36 in."
		},
		
		"img/portfolioImages/3d_2.jpg" : {
			"name" : "3-Dimensional Design",
			"description" : "Abstract wrench model made entirely out of paper products. Paper, illustration board, gesso."
		},
		
		"img/portfolioImages/d2_4.jpg" : {
			"name" : "Drawing II",
			"description" : "Still life with male and female models, skeleton, and cloth. Charcoal and pastel on newsprint. 24x36 in."
		},
		

		
		"img/portfolioImages/3d_3.jpg" : {
			"name" : "3-Dimensional Design",
			"description" : "Non-representational wrench model made entirely out of paper products. Paper, illustration board, glue, gesso."
		},





		
		"img/portfolioImages/09-13-2013_cert.png" : {
			"name" : "IDL6543 Certificate",
			"description" : "Certificate awarded for participating in the IDL6543 student panel at the University of Central Florida, September 13, 2013."
		},
		
		"img/portfolioImages/12-02-2013_letter.png" : {
			"name" : "IDL6543 Letter",
			"description" : "'Thank you' letter for participating in the IDL6543 student panel at the University of Central Florida, December 2, 2013."
		},
		
		"img/portfolioImages/05-17-2013_cert.png" : {
			"name" : "IDL6543 Certificate",
			"description" : "Certificate awarded for participating in the IDL6543 student panel at the University of Central Florida, May 17, 2013."
		},


		"img/portfolioImages/08-05-2013_letter.png" : {
			"name" : "IDL6543 Letter",
			"description" : "'Thank you' letter for participating in the IDL6543 student panel at the University of Central Florida, August 5, 2013."
		},
		
		"img/portfolioImages/01-25-2013_cert.png" : {
			"name" : "IDL6543 Certificate",
			"description" : "Certificate awarded for participating in the IDL6543 student panel at the University of Central Florida, January 25, 2013."
		},
		
		"img/portfolioImages/05-01-2013_letter.png" : {
			"name" : "IDL6543 Letter",
			"description" : "'Thank you' letter for participating in the IDL6543 student panel at the University of Central Florida, May 1, 2013."
		}
		

	}
}
